---
kind: type
id: T:Autodesk.Revit.DB.Lighting.RectangleLightShape
source: html/1b9a5edf-d0dc-ce3b-cedd-75c01e431bac.htm
---
# Autodesk.Revit.DB.Lighting.RectangleLightShape

This class encapsulates a rectangle light shape.

## Syntax (C#)
```csharp
public class RectangleLightShape : LightShape
```